<template>
    <section class="vgcm-faq">
        <CompTitling
            :title="'Часто задаваемые вопросы'"
            :subtitle="'Ваш комфорт — наш приоритет. Мы собрали ответы на самые популярные вопросы, чтобы избавить вас от сомнений.'" />
        <div class="vgcm-faq__content container">
            <div class="vgcm-faq__questions">
                <div class="vgcm-faq__list">
                    <div
                        v-for="(item, index) in faq"
                        :key="index"
                        :class="{'vg-active': index == currentFaq}"
                        class="vg-faq">
                        <div
                            class="vg-faq__toggler"
                            @click="currentFaq = currentFaq == index ? null : index">
                            <span class="vg-faq__toggler-num">{{ index < 10 ? "0" + index : index }}</span>
                            <p class="vg-faq__toggler-label">{{ item.question }}</p>
                        </div>
                        <div class="vg-faq__body">
                            <p class="vg-faq__body-txt">{{ item.answer }}</p>
                        </div>
                    </div>
                </div>
            </div>
            <div
                class="vgcm-faq__form"
                data-scroll
                data-scroll-sticky
                data-scroll-target=".vgcm-faq__content"
                data-scroll-offset="-50, 50">
                <h2 class="vgcm-faq__form-title">Остались вопросы?</h2>
                <p class="vgcm-faq__form-desc">
                    Пусть Заполните анкету ниже — и мы свяжемся с Вами в кратчайшие сроки. Наши специалисты с удовольствием проконсультируют Вас, помогут с выбором тура и подготовят все необходимые документы.
                    <br />
                    <strong>Пусть подготовка к отдыху будет лёгкой, а впечатления — яркими!</strong>
                </p>

                <div class="vgcm-faq__form-block">
                    <!-- :inputClass="[{'vg-error': form.mail.haserror === true}, {'vg-success': form.mail.haserror === false}]" -->
                    <!-- v-model="form.mail.value" -->
                    <!-- :handleBlur="() => handleBlur('mail')" -->
                    <CompInput
                        class="vgcm-faq__form-input"
                        placeholder="Ваше Ф.И.О"
                        type="email" />
                    <CompInput
                        class="vgcm-faq__form-input"
                        placeholder="Ваш номер телефона"
                        type="email" />
                    <CompTextarea
                        class="vgcm-faq__form-textarea"
                        placeholder="Текст сообщения..."
                        type="email" />
                    <CompButton
                        class="vgcm-faq__form-btn"
                        :vgbtnText="'Оставить заявку'" />
                </div>
            </div>
        </div>
    </section>
</template>

<script>
import CompInput from "@/components/compInput.vue";
import CompTextarea from "@/components/compTextarea.vue";

export default {
    name: "section-faq",
    components: {CompInput, CompTextarea},
    data() {
        return {
            currentFaq: 0,
            faq: [
                {
                    question: "Какие документы потребуются для поездки за границу?",
                    answer: "Ваш заграничный паспорт, ваучер, авиабилеты и страховка.",
                },
                {
                    question: "Когда нужно разрешение на выезд для ребенка?",
                    answer: "Если родители или один родитель не летят в поездку с ребенком, тогда вам потребуется нотариальное разрешение и печать сопровождающего. Исключение из правил поездка в Египет( Шарм Эль Шейх) . По правилам ребенок не достигнувший 21 года, не имеет права въезжать на территорию Шарм Эль Шейха без сопровождения родителей или одного из родителей.",
                },
                {
                    question: "Нужно ли брать с собой «внутренний» паспорт?",
                    answer: "Нет, внутренний паспорт для вашей поездки заграницу не потребуется. Так как всю поездку Вы оформляете только на заграничный паспорт.",
                },
                {
                    question: "Когда со мной свяжутся, если я отправил заявку на тур или оплатил его на сайте?",
                    answer: "Оставляя заявку на тур или оплачивая его он-лайн, в конце процедуры Вы увидите сообщение от системы о том, что Ваша заявка или оплата принята. Убедитесь, что Ваши контактные данные были введены корректно. Получив Вашу заявку с сайта, наши менеджеры свяжутся с Вами. Если же Ваша заявка была оставлена в период с 21:00 до 10:00 по Ташкентскому времени, то наш менеджер свяжется с Вами в период с 10:00 до 21:00. По указанному Вами номеру телефона через WhatsApp/Telegram -  с Вами свяжется наш менеджер для проверки и подтверждения всех параметров тура и наличия данного тура у туроператора на данный момент. Если все параметры и наличие согласованы, то подтверждение от туроператора приходит обычно в течение 3-х дней после оплаты.",
                },
                {
                    question: "Какие размеры предоплаты за тур?",
                    answer: "При бронировании тура в офисе Вы можете внести от 30 до 50% от стоимости тура, а остальную сумму внести позже. Дальнейший график доплат уточняйте у Вашего менеджера. При покупке горящего тура, необходимо вносить всю стоимость тура единовременно. При покупке тура на сайте Вы сразу оплачиваете всю сумму полностью.",
                },
                {
                    question: "Что такое подтверждение от туроператора и как долго его необходимо ждать?",
                    answer: "После бронирования тура, необходимо дождаться его подтверждение, т.е. туроператор должен подтвердить наличие номера и мест на рейсе. Обычно подтверждение приходит в течении 1-2 дней однако, на пиковые даты (майские праздники, новый год и т.д.) бывают задержки до 3 дней.",
                },
                {
                    question: "Мне не подтвердили тур, что делать?",
                    answer: "В случае, если тур не подтверждается, Ваш персональный менеджер подберет для Вас альтернативные варианты. В случае, если ни один из вариантов Вам не подойдет, Вы можете написать заявление об отказе от тура, после чего Вам возвратят деньги, выплаченные за бронирование.",
                },
                {
                    question: "Где, когда и как я получаю пакет документов для вылета?",
                    answer: "Документы на вылет выдаются в офисе компании за день до вылета. Возможно, документы могут прийти раньше за 2-3 дня, информацию об этом сообщит Вам Ваш персональный менеджер. За 1-4 дня документы отправляет отдел сопровождения. При оплате тура он-лайн, все необходимые документы приходят на электронную почту за сутки до вылета. Не забудьте их распечатать!",
                },
                {
                    question: "За сколько необходимо приехать в аэропорт вылета?",
                    answer: "Лучше всего, приехать в аэропорт до вылета за 3 часа, планируйте свое время заранее. В сезон (летом, новогодние праздники), так же необходимо приезжать в аэропорт заранее.",
                },
                {
                    question: "Отличие турагента от туроператора?",
                    answer: "Туроператор формирует туристский продукт (поиск зарубежных партнеров, выбор гостиниц, подбор экскурсий, осуществляет переговоры с авиакомпаниями, страховыми компаниями и т.д.) Туристическое агентство занимается продвижением и реализацией данного туристского продукта потенциальным туристам. Туроператор, как правило, не берет на себя функции общения с туристами напрямую, эту функцию выполняет турагентство.",
                },
                {
                    question: "Выгоднее ли купить тур у туроператора?",
                    answer: "Менеджеры туроператора не уделят вам внимания при подборе тура. Цена вряд ли будет отличной от той, по которой вам продаст путевку турагентство. Кроме того, туристические агентства могут сотрудничать с несколькими туроператорами, что расширяет количество возможных вариантов тура и цен на него.",
                },
                {
                    question: "Что такое горящий тур?",
                    answer: "Это тур, который может не продаться по полной цене из-за приближающихся сроков отправки. Поэтому туроператор максимально снижает цену, чтобы его реализовать. Для туриста такие предложения – риск, потому что нет возможности выбора отеля, нельзя запланировать поездку и подготовить визу заранее.",
                },
                {
                    question: "Можно ли внести изменения в оплаченный тур?",
                    answer: "Можно. Чем раньше, тем лучше. Стоимость тура будет варьироваться в соответствии с изменениями. Выгоднее всего вносить изменения в тур, не меняя туроператора. Это будет точно удобнее и выгоднее.",
                },
                {
                    question: "Что делать, если ваш багаж утерян?",
                    answer: "Нужно обратиться в службу розыска багажа аэропорта. Искать утраченные вещи будут 21 день, после чего авиакомпания должна выплатить компенсацию. Есть два варианта выплат, они зависят от стран, в которых зарегистрирована авиакомпания. Выплачивают или 1400 $ за весь багаж или по 20 $ за каждый килограмм.",
                },
                {
                    question: "Почему нельзя заселиться в отель с утра?",
                    answer: "Есть международные нормы поселения в отели. Вселение происходит в 14.00, а выселение в 12.00. Таким образом, у персонала есть 2 часа на уборку номера. В индивидуальном порядке можно договориться о заселении пораньше или отъезде позже. Но даже если такое возможно, то следует быть готовым к дополнительной оплате. ",
                },
                {
                    question: "Что такое Шенгенская виза?",
                    answer: "Шенгенская виза – своеобразный пропуск, который выписывается для въезда в государства Шенген-зоны. В 26 государств, которые решили примкнуть к одноименному соглашению. На внутренних рубежах этих стран отсутствует пограничный контроль. Поэтому получив Шенгенскую визу, разрешается посещать любые государства из этого списка.",
                },
                {
                    question: "Что такое мультивиза?",
                    answer: "Мультивиза – документ, который разрешает когда захочется и сколько захочется раз въезжать в страну. В паспорте обозначается буквой М. Она может выдаваться сроком от полугода до 5 лет. Часто, говоря про мультивизу, имеют в виду визу в Европейский союз, которая дается на год и открывает для посещения все страны в зоне Шенген.",
                },
                {
                    question: "Чем отличаются 3-х, 4-х и 5-звездочные гостиницы?",
                    answer: "Зачастую туристы имеют лишь примерное понимание, какие особенности разделения гостиниц по звездности. А ведь все отели относятся к той или иной категории по четко сформулированным принципам, и соответствие статусу периодически проверяется специальными организациями. Чтобы избежать неожиданностей при заселении, нужно знать, чем отличаются 3-х, 4-х и 5-звездочные отели. Различия по звездности Отели 3 звезды относятся к среднему классу, 4 – к первому, 5 – к высшей категории. Они отличаются: По площади номеров: двухместный стандартный при 3-х и 4-х звездах не должен быть менее 12 кв.м, при 5 – не менее 16 кв.м. По оснащению номеров: в 3-звездочном среди дополнительных предметов меблировки есть туалетный столик с зеркалом, телефон для связи внутри отеля, возможно, кондиционер и сейф. В 4-звездочном, помимо указанного, есть также телефон в номере для совершения городских звонков, мини-бар. В 5-звездочном – обязательно все упомянутые преимущества. Бытовыми приборами и гигиеническими средствами: если в 3-звездочном вам предоставят только мыло, то в 4-звездочном вы найдете также шампунь, гель для душа, фен. В пятизвездочном – также полный набор. Предоставлением белья: в «тройке» и «четверке» есть постельное белье и полотенца на каждого постояльца. В «пятерке» к этому набору прибавляются в большинстве случаев халаты и тапочки. Причем в 3-звездочном номере смену белья и полотенец проводят 2 раза в неделю, в 4-х и 5-звездочных – каждый день. Уборка во всех номерах проводится ежедневно. Территорией и находящимися на ней заведениями: к «тройке» прилагаются максимум бассейн, автостоянка и пункт обмена валют, в то время как в «четверке» есть бары, салоны красоты, спа, спортивный зал и пр. В пятизвездочном отеле вы также найдете пункт проката автомобилей, магазины, несколько бассейнов, рестораны с разной кухней. Как видно, четкая разница есть только между «тройками» и «пятерками». Поэтому нужно ориентироваться больше на рекомендации, отзывы и фото номеров, территории гостиницы.",
                },
                {
                    question: "Что такое хостел?",
                    answer: "Хостел – это маленькое общежитие для экономных путешественников. Если вы стеснены в средствах, но хотите увидеть мир, то хостел – прекрасное место для безопасной ночевки. Обычно это выглядит так: комнаты с двухъярусными кроватями, телевизором, местом для зарядки гаджетов, WI-FI и удобствами в коридоре. Для туристов доступна общая кухонька с бесплатным кофе, небольшая прачечная.",
                },
                {
                    question: "Что это за новшество: отели 6 и 7 звезд?",
                    answer: "Отели в 6 и 7 звезд появились недавно. Они ориентированы на VIP-клиентуру. Здесь к каждому гостю приставлен батлер (дворецкий). Поскольку большинство сервисов соответствует 5 звездам, то менеджмент отеля пытается повысить свой статус заботой о клиентах и оригинальностью развлечений. Таким образом, батлер выполнит все прихоти, если они не противоречат законодательству, постояльцу могут даже вставить ортопедические стельки в обувь, для большего удобства. В этих отелях клиентов будут окружать золото, технические новинки и экзотические кулинарные изыски.",
                },
                {
                    question: "Что можно взять из номера на память об отпуске?",
                    answer: "С собой можно взять туалетные принадлежности (мыло, шампунь, гель для душа), наборы с логотипами отеля: канцелярский, швейный, для чистки обуви, спички, зубочистки, подарочки от отеля. Считается, что можно взять тапочки, ведь они – одноразовые. Возле газет и журналов обычно стоит объявление, что их можно брать с собой, в противном случае в счет внесут оплату прессы. Все остальные прихваченные «сувениры» будут считаться воровством.",
                },
                {
                    question: "Что означает «индивидуальный тур»?",
                    answer: "Это значит, что тур будет подобран с учетом пожеланий заказчика. Такие путевки заказывают те, кто хочет посетить места, далекие от массового паломничества туристов, а также просто люди, ценящие отдых. Туристу предоставят все: персонального гида, желаемую авиакомпанию, нужный трансфер по стране, прокат авто любимой модели, бронирование определенного номера в конкретном отеле.",
                },
                {
                    question: "Самостоятельный туризм или пакетный тур?",
                    answer: "На самом деле, все зависит от желаемого направления. Туры по системе «все включено» выгоднее приобретать в туристических агентствах. Если же Вы хотите провести недельку во Франции, наслаждаясь лавандовыми полями и вином, то такой тур можно организовать самому, но лучше доверить это опытному агенту. Кроме того, при покупке пакетного тура в туристическом агентстве, агентство несет ответственность за успешную его организацию, в том числе и уведомляет обо всех изменениях. Например, Вы самостоятельно приобретаете билет на чартерный рейс. Чартеры, как известно, не имеют конкретного расписания, и многие авиакомпании не уведомляют туристов об изменении времени вылета. За сутки до вылета Вы забыли проверить точное время. Либо Вы живете не в городе, из которого вылетаете, и не успеваете добраться до аэропорта. Все, рейс Вы пропустили. Купив тур в туристическом агентстве, Вам не нужно беспокоиться ни о чем, турагент все решит за Вас и предупредит об изменениях. Или же Вы летите в визовую страну, где необходимо собрать определенный пакет документов. При самостоятельном путешествии Вам будет необходимо «гуглить» и заморачиваться со сбором документов. В туристическом агентстве все сделают за Вас, необходимо предоставить только минимальный набор документов. В общем, если Вы не хотите самостоятельно искать тур, подбирать удобные рейсы и выбирать из множества отелей, - тогда Вам к нам! А если планирование тура уже является началом Вашего путешествия, то в интернете много сервисов для самостоятельной брони билетов и отелей.",
                },
                {
                    question: "Ваше турагентство может помочь мне найти попутчика?",
                    answer: "Да, мы можем помочь Вам с этим вопросом, к нам часто обращаются туристы которые очень хотят поехать отдохнуть но им попросту не с кем поехать.",
                },
                {
                    question: "Делаете ли вы скидки на туры?",
                    answer: "Конечно делаем, а если Вы наш постоянный турист, то у нас есть своя особая система скидок.",
                },
            ],
        };
    },
    mounted() {},
    methods: {},
};
</script>

<style lang="scss">
@import "./sectionFAQ.scss";
</style>

1. 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. 21. 22.
